Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/irish_constitution_1/constitution_fundamental_rights.html.txt.tmx
Source language: en
Languages: ga

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann

source: The Constitution recognises and declares that people living in Ireland have certain fundamental personal rights
ga: Aithnítear agus dearbhaítear sa Bhunreacht go bhfuil bunchearta áirithe pearsanta ag daoine a chónaíonn in Éirinn

source: These rights are natural human rights and are confirmed and protected by the Constitution
ga: Is cearta nádúrtha daonna iad seo agus deimhníonn agus cosnaíonn an Bunreacht iad

source: Not every fundamental right that you possess is set out in the Constitution - you have many personal rights that are not specifically stated in the Constitution
ga: Níl gach buncheart atá agat leagtha amach sa Bhunreacht – d’fhéadfadh go bhfuil go leor cearta pearsanta agat nach luaitear go sonrach sa Bhunreacht

source: These rights may be derived or implied from the Constitution
ga: D’fhéadfadh na cearta seo eascairt ón mBunreacht nó bheith curtha in iúl inti

source: For example, the Constitution does not specifically state a right to privacy but the courts recognise that the personal rights in the constitution imply the right to privacy
ga: Mar shampla, ní luaitear go sonrach sa Bhunreacht go bhfuil ceart agat i leith príobháideachais, ach aithníonn na cúirteanna go dtugann na cearta pearsanta sa Bhunreacht an ceart i leith príobháideachais le tuiscint

source: Fundamental rights are not absolute - they can be limited or restricted by the Oireachtas on the grounds, for example, of the common good or public order
ga: Níl bunchearta absalóideach – féadfaidh an tOireachtas iad a theorannú nó iad a chosc ar bhonn, mar shampla, leas coiteann nó ord poiblí

source: Every constitutional right has the same status and value
ga: Tá ag gach ceart bunreachtúil an stádas agus an fiúntas céanna

source: If there is a conflict between the constitutional rights of individuals, the courts will look at all the circumstances and weigh all of the factors to decide which constitutional right is more important in that particular case
ga: Más ann do choimhlint idir cearta bunreachtúla daoine, breathnóidh na cúirteanna ar na cúinsí uile agus déanfaidh siad gach ceann de na tosca a bhreithniú le cinneadh a dhéanamh ar cén ceart bunreachtúil is tábhachtaí sa chás ar leith sin

source: Equality before the law
ga: Comhionannas os comhair an dlí

source: All citizens in Ireland shall be held equal before the law
ga: Caithfear le gach saoránach in Éirinn ar an gcaoi chéanna os comhair an dlí

source: This means that the State cannot unjustly, unreasonably or arbitrarily discriminate between citizens
ga: Ciallaíonn seo nach féidir leis an Stát, idirdhealú a dhéanamh go héagórach, go mí-réasúnta nó go hansmachtúil idir saoránaigh

source: You cannot be treated as inferior or superior to any other person in society simply because of your human attributes or your ethnic, racial, social or religious background
ga: Ní féidir caitheamh leat amhail bheith íseal ó thaobh gradaim nó ard ó thaobh gradaim i leith aon duine eile sa tsochaí díreach mar gheall ar do thréithe daonna nó do chúlra eitneach, ciníoch, sóisialta nó reiligiúnach

source: However, when the state is making laws, it may consider differences of capacity and of social function between individuals in society
ga: Nuair a bhíonn dlíthe á ndéanamh ag an Stát, áfach, féadfaidh an Stát breithniú a dhéanamh ar éagsúlachtaí cumais agus feidhme sóisialta idir daoine sa tsochaí

source: The Constitution specifically recognises and protects your right to life
ga: Aithníonn agus cosnaíonn an Bhunreacht do cheart chun beatha

source: Your right to life also means the right to have nature take its course and to die a natural death
ga: Ciallaíonn do cheart chun beatha an ceart chun ligean don nádúr leanúint ar aghaidh agus chun bás nádúrtha a fháil

source: That does not mean that you have the right to have your life terminated or death accelerated
ga: Ní chiallaíonn sé go bhfuil an ceart agat deireadh a chur le do shaol ná brostú a dhéanamh ar do bhás

source: Your right to die is simply the right to die a natural death and not to be kept alive by artificial means
ga: Is éard atá i gceist le do cheart chun beatha, ná go ligfí duit bás nádúrtha a fháil agus nach gcuirfí fad le do shaol ar bhealach bréige

source: The right to life of the unborn was inserted into the Constitution by a constitutional amendment in 1983
ga: Cuireadh ceart beatha leanaí gan bhreith leis an mBunreacht ag leasú bunreachtúil i 1983

source: The equal right to life of the mother is also protected
ga: Ina theannta sin, cosnaítear ceart comhionann chun beatha na máthar

source: In 1992, two amendments were added to the Constitution; the right of the mother to travel to another state and freedom of information in relation to services available in another state
ga: I 1992, cuireadh dhá leasú leis an mBunreacht; an ceart atá ag an máthair chun taisteal go dtí stát eile agus an ceart i leith saoráil faisnéise maidir le seirbhísí atá ar fáil i stát eile

source: The Constitution guarantees that you have a right to liberty and freedom, except in accordance with the law
ga: Deimhníonn an Bhunreacht go bhfuil ceart agat i leith saoirse, seachas i gcomhréir leis an dlí

source: This means that, in general, you are entitled to your own personal freedom but legislation may provide for your arrest and detention in certain circumstances
ga: Ciallaíonn seo, go ginearálta, go bhfuil tú i dteideal do shaoirse féin phearsanta a bheith agat, ach féadfaidh reachtaíocht foráil a dhéanamh do do ghabháil agus do choinneáil faoi chúinsí áirithe

source: The State may only breach your right to personal liberty in circumstances that come within a law that provides for your arrest and/or detention
ga: Ní féidir leis an Stát do cheart chun saoirse phearsanta a shárú faoi chúinsí a chuimsítear laistigh de dhlí a fhorálann do ghabhail agus/nó do choinneáil

source: If you believe that you are being detained or held unlawfully, you may make an application to the High Court
ga: Má chreideann tú go bhfuil tú á choinneáil nó á choimeád go neamhdhleathach, féadfaidh tú iarratas a dhéanamh ar an Ard-Chúirt

source: If the person or institution detaining you cannot justify the detention or prove that it is lawful, the High Court may order that you be released
ga: Murar féidir leis an duine nó an institiúid atá do do choinneáil údar a thabhairt le do choinneáil nó a chruthú gur coinneáil dhleathach atá i gceist, féadfaidh an Ard-Chúirt a ordú go scaoilfear thú

source: This is called a Habeas Corpus order
ga: Tugtar ordú Habeas Corpus air seo

source: You have a right to freely express your convictions and opinions
ga: Tá an ceart agat chun do dhaorbhreitheanna agus do thuairimí a nochtadh

source: However, the Constitution asserts that the State should try to make sure that the radio, the press and the cinema are not used to undermine public order or morality or the authority of the State
ga: Ach luaitear sa Bhunreacht gur cheart go ndéanfadh an Stát deimhin de nach n-úsáidtear an raidió, na nuachtáin agus an cineama chun an bonn a bhaint d'ord poiblí nó de mhoráltacht nó d'údarás an Stáit

source: It also states that it is an offence to publish or utter blasphemous, seditious or indecent matter
ga: Luaitear freisin gur cion é ábhar diamhaslach, ceannairceach nó mígheanasach a lua nó a fhoilsiú

source: There are some limitations on your freedom of expression
ga: Tá roinnt teorainneacha ar do shaoirse nochta

source: For example, the Censorship of Publications Acts and the Censorship of Films Acts allow censorship of publications like books, films and DVDs
ga: Mar shampla, ceadaíonn na hAchtanna um Chinsireacht ar Scannáin cinsireacht ar fhoilseacháin ar nós leabhar, scannán agus DVDanna

source: You have a right to assemble or meet peacefully and without weapons
ga: Tá an ceart agat chun teacht ar tionól nó chun teacht le chéile go síochánta agus gan airm

source: This right is limited by legislation to protect public order and morality
ga: Déanann an reachtaíocht an ceart seo a shrianadh d’fhonn ord agus moráltacht phoiblí a chosaint

source: The law prevents or controls meetings that are calculated or designed to cause a riot or breach of the peace
ga: Déanann an dlí cruinnithe a chosc agus a rialú a mheastar a bheidh ina gcúis le círéib nó le sárú na síochána nó a dheartar le hamhlaidh a dhéanamh

source: There are other limitations on your freedom of assembly
ga: Tá roinnt teorainneacha eile ar do shaoirse chun teacht ar tionól

source: You cannot meet on private property without the consent of the owner - that is trespass
ga: Ní féidir leat teacht le chéile ar réadmhaoin phríobháideach gan toiliú an úinéara – is ionann sin agus bradaíl

source: Parades and processions are not illegal but it is a public nuisance to obstruct a highway
ga: Níl paráidí agus mórshiúlta in aghaidh an dlí ach is núis phoiblí é chun bac a chur le príomhbhóthar

source: You may not hold a procession or meeting within half a mile of the Oireachtas when it has been prohibited by the Gardaí or you have been asked to disperse
ga: Níl cead agat mórshiúl nó cruinniú a chur ar bun laistigh de leathmhíle den Oireachtas nuair a chuir na Gardaí cosc air sin nó má iarradh ort scaipeadh

source: The Constitution guarantees your right to form associations and unions
ga: Deimhnítear sa Bhunreacht go bhfuil an ceart agat chun comhlachais agus cumainn a bhunú

source: You may form any type of association for whatever purpose you choose, whether it is sporting, social, charitable, commercial or political
ga: Féadfaidh tú aon saghas comhlachais a bhunú ar mhaithe le haon chuspóir is mian leat, cibé acu más comhlachas spóirt, sóisialta, carthanúil, tráchtála nó polaitiúil é

source: For example, associations formed for the purpose of treason or some anti-constitutional or illegal purpose cannot rely on this right to freedom of association
ga: Mar shampla, ní féidir le comhlachais a bunaíodh ar mhaithe le tréas nó le cuspóir ar leith frithbhunreachtúil nó mídhleathach brath ar an gceart seo chun comhlachas a bhunú

source: The right to fair procedures
ga: Ceart do chothrom na féinne

source: The courts, and all other bodies or persons making decisions that affect you, must treat you fairly
ga: Tá ar na cúirteanna agus gach comhlacht nó duine eile a dhéanann cinntí a dhéanann difear duit, caitheamh leat go cóir

source: There are two essential rules of fair procedure
ga: Tá dhá riail ríthábhachtacha um chothrom na féinne ann

source: •The person making the decision that affects you should not be biased or appear to be biased
ga: • Níor chóir don té a bhfuil cinneadh á dhéanamh acu a dhéanann difear duit bheith claonta nó an tuairim a thabhairt go bhfuil siad claonta

source: •You must be given an adequate opportunity to present your case
ga: • Ní mór deis leordhóthanach a thabhairt duit chun do chás a chur i láthair

source: You must be informed of the matter and you must be given a chance to comment on the material put forward by the other side
ga: Ní mór duit bheith curtha ar an eolas faoin ábhar agus ní mór go dtugtar deis duit chun do thuairim a chur in iúl ar an ábhar atá á chur chun cinn ag an taobh eile

source: You have a right not to have your body or person interfered with
ga: Tá an ceart agat do chorp agus do phearsa a bheith saor ó chur isteach

source: This means that the State may not do anything to harm your life or health
ga: Ciallaíonn seo nach féidir leis an Stát aon rud a dhéanamh chun cur isteach ar do shaol nó ar do shláinte

source: If you are in custody, you have a right not to have your health endangered while in prison
ga: Má tá tú faoi choinneáil, tá an ceart agat gan do shláinte a bheith curtha i mbaol fad atá tú sa phríosún

source: Your right to trial by jury only exists in certain criminal cases
ga: Tá sé de cheart agat triail a fháil le giúiré i gcásanna áirithe coiriúla

source: If you have been charged with a "non-minor" offence, you will be tried by a judge sitting with a jury
ga: Má cúisíodh thú le cion nach mionchion é, déanfar thú a thriail le breitheamh a shuífidh le giúiré

source: There are some offences for which you will be given a choice - whether you want to have your case decided by a District Court Judge sitting alone or by a judge sitting with a jury
ga: Tá roinnt cionta ann a dtabharfar rogha duit ina dtaobh – cibé acu an mian leat go ndéanfaidh Breitheamh den Chúirt Dúiche cinneadh ar do chás a shuífidh leis/léi féin nó breitheamh a shuífidh le giúiré

source: The jury must consist of non-lawyers who have been chosen at random from a diverse range of jurors from the community
ga: Ní mór nach mbeidh daoine nach aturnaetha iad bheith sa ghiúiré a roghnaíodh go randamach ó réimse fairsing giúróirí ón bpobal

source: Your are free to practise your religion and your freedom of conscience
ga: Is fútsa atá sé do reiligiún agus do shaoirse choinsiasa a chleachtadh

source: The State guarantees not to endow or favour any religion and not to discriminate on the grounds of religion
ga: Deimhníonn an Stát nach bhfaomhfaidh siad agus nach roghnóidh siad aon reiligiún agus nach ndéanfaidh siad idirdhealú ar bhonn reiligiúin

source: State aid for schools cannot discriminate between schools of different religious denominations
ga: Ní féidir le cúnamh Stáit do scoileanna idirdhealú a dhéanamh idir scoileanna de shainaicmí éagsúla creidimh

source: Every child has the right to attend a denominational school receiving State funding without having to participate in religious instruction in the school
ga: Tá ag gach leanbh an ceart chun freastal ar scoil sainaicme chreidimh a fhaigheann cistiú Stáit gan bheith rannpháirteach i dteagasc reiligiúnach sa scoil sin

source: Your right to religious liberty may be limited to protect public order and morality
ga: D’fhéadfaí do cheart chun saoirse chreidimh a shrianadh d’fhonn ord agus moráltacht phoiblí a chosaint

source: The right to privacy
ga: An ceart chun príobháideachais

source: The Constitution does not specifically state a right to privacy but the courts recognise that the personal rights in the Constitution imply the right to privacy
ga: Ní luaitear go sonrach sa Bhunreacht go bhfuil ceart agat i leith príobháideachais, ach aithníonn na cúirteanna go dtugann na cearta pearsanta sa Bhunreacht an ceart i leith príobháideachais le tuiscint

source: For example, your private written communications and telephone conversations cannot be deliberately, consciously and unjustifiably interfered with
ga: Mar shampla, ní féidir cur isteach d’aon turas, go coinsiasach agus gan údar a thabhairt, ar do chumarsáid phríobháideach scríofa agus ar do chomhráite ar an nguthán

source: However, your right to privacy may be limited or restricted by legislation in the interests of the common good, public order and morality
ga: D’fhéadfaí do cheart chun príobháideachais a theorannú nó shrianadh ag an reachtaíocht ar mhaithe le leas coiteann, ord nó moráltacht phoiblí

source: The right to earn a livelihood
ga: An ceart chun slí bheatha a bhaint amach

source: As a citizen, you have a right to work and to earn a living, whether you are male or female
ga: Mar shaoránach, tá an ceart agat chun oibriú agus chun slí bheatha a bhaint amach, cibé acu más fear nó bean thú

source: The State is under a duty to protect your right to work and earn a livelihood from unjust attack
ga: Tá dualgas ar an Stát do cheart chun oibriú agus chun slí bheatha a bhaint amach a chosaint ó ionsaí éagórach

source: You have a right to move freely within the State
ga: Tá an ceart agat chun gluaiseacht gan chosc a bheith ort laistigh den Stát

source: You also have a broader right to travel and to obtain a passport for the purpose of travelling
ga: Ina theannta sin, tá ceart níos fairsinge agat chun taisteal agus chun pas a fháil ar mhaithe le taisteal a dhéanamh

source: Your right to a passport may be restricted or limited
ga: Féadtar do cheart chun pas a fháil a theorannú nó a shrianadh

source: For example, before granting you bail, a court may require that you agree to hand over your passport
ga: Mar shampla, sula ndeonaítear banna duit, féadfaidh cúirt a iarraidh go gcomhaontaíonn tú go dtabharfaidh tú do phas suas

source: The State may also restrict your right to travel for the purposes of national security
ga: Sa mhullach air sin, féadfaidh an Stát do cheart chun taisteal a shrianadh ar mhaithe le slándáil náisiúnta

source: Inviolability of a citizen's dwelling
ga: Dosháraitheacht áit chónaithe saoránaigh

source: The Constitution declares that the dwelling of a citizen is inviolable and shall not be entered forcibly except in accordance with the law
ga: Dearbhaítear sa Bhunreacht go bhfuil áit chónaithe saoránaigh dosháraitheach agus níl cead ag duine dul isteach ann le fórsa, seachas i gcomhréir leis an dlí

source: This means that no one, including the Gardaí, may enter the place where you live without a warrant or other legal authority to enter
ga: Ciallaíonn seo nach féidir le haon duine, na Gardaí san áireamh, dul isteach san áit ina gcónaíonn tú gan bharántas nó údarás eile dlíthiúil a cheadaíonn dóibh dul isteach ann

source: If you are arrested as a result of an unlawful entry into your home, your arrest is illegal
ga: Má dhéantar thú a ghabháil mar thoradh ar iontráil neamhdhleathach i d’áit chónaithe, rinneadh thú a ghabháil go mídhleathach

source: Evidence obtained as a result of an unlawful entry onto your dwelling is inadmissible in court
ga: Ní ghlacfaidh na cúirteanna le fianaise a thugtar mar thoradh ar dhul isteach neamhdhleathach i d'áit chónaithe

source: The Constitution declares that the State will vindicate the property rights of every cititizen
ga: Dearbhaíonn an Bhunreacht go gcosnóidh an Stát cearta maoine gach saoránaigh

source: This means that you have a right to own, transfer and inherit property
ga: Ciallaíonn seo go bhfuil an ceart agat chun bheith i d’úinéir ar mhaoin agus chun maoin a aistriú agus a fháil le hoidhreacht

source: You also have the right to bequeath property upon your death
ga: Ina theannta sin, tá an ceart agat chun maoin a thiomnú nuair a fhaigheann tú bás

source: The State guarantees to pass no law to abolish these rights
ga: Deimhníonn an Stát gan aon dlí a rith chun na cearta seo a bhaint

source: Article 43 acknowledges that these rights ought to be regulated by the principles of social justice
ga: Aithnítear in Airteagal 43 gur cheart na cearta seo a rialú ag prionsabail an cheartais shóisialta

source: This means that the State may pass laws limiting your right to private propety in the interests of the common good
ga: Ciallaíonn seo gur féidir leis an Stát dlíthe a rith a leagann teorainn ar do cheart chun maoin phríobháideach a bheith agat ar mhaithe le leas coiteann

source: If the state passes a law that restricts your property rights, it may be required to compensate you for this restriction
ga: Má ritheann an Stát dlí a leagan srian ar do chearta maoine, d’fhéadfadh go mbeadh orthu thú a chúiteamh don srianadh seo

source: Examples of restrictions or limitations on your right to own property include town and regional planning, protection of national monuments, compulsory acquisition of land and property taxes
ga: Is samplaí iad pleanáil baile agus réigiúnach, cosaint séadchomharthaí náisiúnta, talamh a ghnóthú go héigeantach agus cáin maoine de na srianta is féidir a chur ar an gceart atá agat chun maoin a shealbhú

source: The family founded on marriage possesses a collection of constitutional rights
ga: Tá ag an teaghlach a bunaíodh ar phósadh sraith cearta bunreachtúla

source: • The right to marital privacy
ga: • An ceart chun príobháideachas pósta

source: This means that couples may make their own decisions about family planning
ga: Ciallaíonn seo go bhfuil sé de cheart ag lánúin a gcuid cinntí féin a dhéanamh maidir le pleanáil clainne

source: • The right to consort together, to enjoy each other's company and to procreate
ga: • An ceart chun oibriú as lámh a chéile, chun taitneamh a bhaint as comhluadar a chéile agus chun tuismiú a dhéanamh

source: This right may be limited or restricted where a family member is in prison or where one spouse is not an Irish citizen
ga: Féadfar an ceart seo a theorannú nó a shrianadh nuair atá duine muinteartha sa phríosún nó nuair nach saoránach Éireannach céile amháin

source: You can read more about prisoners' rights here
ga: Féadfaidh tú tuilleadh a léamh faoi chearta príosúnach anseo

source: • The right of parents to be the main and natural educators of their children
ga: • Tá sé de cheart ag tuismitheoirí bheith ina bpríomhoidí nó oidí nádúrtha dá gcuid leanaí

source: The State must respect your right as parents to provide for the religious, moral, intellectual, physical and social education of your children
ga: Caithfidh an Stát aitheantas a thabhairt do do cheart mar thuismitheoirí chun oideachas creidimh, morálta, intleachtúil agus sóisialta a sholáthar do do leanaí

source: The State cannot oblige you to send your children to school or to any particular type of school but it may require that children receive a certain minimum education
ga: Ní féidir leis an Stát iallach a chur ort do chuid leanaí a chur ar scoil nó chuig aon chineál scoile áirithe, ach is féidir leo iallach a chur ort go gcuirtear íosmhéid áirithe oideachais ar leanaí

source: • The right to free primary education - this means that the State must pay for your children's primary education
ga: • Cearta bunoideachas saor in aisce – ciallaíonn seo go gcaithfidh an Stát íoc as bunoideachas do linbh

source: State aid for schools must not discriminate between schools of different religions
ga: Ní féidir le cúnamh Stáit do scoileanna idirdhealú a dhéanamh idir scoileanna de shainaicmí éagsúla creidimh

source: • The right to decide the religion of your children
ga: • An ceart chun rogha a dhéanamh ar chreideamh do leanaí

source: The State cannot interfere with this right
ga: Ní féidir leis an Stát cur isteach ar an gceart seo

source: There is a constitutional principle that married parents have equal rights to and are joint guardians of their children
ga: Tá prionsabal bunreachtúil i bhfeidhm go bhfuil ag tuismitheoirí pósta cearta comhionanna agus gur comhchaomhnóirí a gcuid leanaí iad

source: If the parents separate or divorce, the courts may decide who will have custody of the children
ga: Má scarann nó má cholscarann na tuismitheoirí, féadfaidh na cúirteanna cinneadh a dhéanamh ar cé aige/aici a bheidh caomhnóireacht na leanaí

source: The paramount consideration is the welfare of the children
ga: Is é an ní is tábhachtaí ar a mbreithneofar leas na leanaí
